Catalogs/РаспределениеПоСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>РаспределениеПоСотрудникам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УбратьИзРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодборОбъектов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодборДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПередающее</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПринимающее</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательПередающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательПринимающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудникаПринимающего</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьПоДолям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудникаПередающего</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСотрудника</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доля</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыРаспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СпособыРаспределения</Name>
			<Comment>Трейд Софт Варианты автоматического распределения должников по сотрудникам</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоровнуПоСуммеДолга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоровнуПоКоличеству</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоровнуПоСуммеДолгаИУбратьИзРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоровнуПоКоличествуИУбратьИзРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьВсемВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятьВсемВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УбратьИзРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПередачи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РаспределениеПоСотрудникам/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СпособРаспределенияПриИзменении(Элемент)    
	ОграничитьВидимость();
КонецПроцедуры                                      

&НаСервере
Процедура ОграничитьВидимость()
	Если Объект.СпособРаспределения = ПредопределенноеЗначение("Перечисление.СпособыРаспределения.ПоровнуПоКоличествуИУбратьИзРаботы")
		ИЛИ Объект.СпособРаспределения = ПредопределенноеЗначение("Перечисление.СпособыРаспределения.ПоровнуПоКоличеству")
		ИЛИ Объект.СпособРаспределения = ПредопределенноеЗначение("Перечисление.СпособыРаспределения.ПоровнуПоСуммеДолга")
		ИЛИ Объект.СпособРаспределения = ПредопределенноеЗначение("Перечисление.СпособыРаспределения.ПоровнуПоСуммеДолгаИУбратьИзРаботы") Тогда
		Элементы.Сотрудники.Видимость = Истина;
		Элементы.СотрудникиТипСотрудника.Видимость = Ложь;
		Элементы.ГруппаАктПередачи.Видимость = Ложь;
		Элементы.РаспределятьПоДолям.Видимость = Истина;
	ИначеЕсли Объект.СпособРаспределения = ПредопределенноеЗначение("Перечисление.СпособыРаспределения.ПередатьВсемВРаботу") Тогда
		Элементы.Сотрудники.Видимость = Истина;
		Элементы.СотрудникиТипСотрудника.Видимость = Истина;
		Элементы.ГруппаАктПередачи.Видимость = Ложь;
		Элементы.РаспределятьПоДолям.Видимость = Ложь;
		Объект.РаспределятьПоДолям = Ложь;
	ИначеЕсли Объект.СпособРаспределения = ПредопределенноеЗначение("Перечисление.СпособыРаспределения.АктПередачи") Тогда
		Элементы.ГруппаАктПередачи.Видимость = Истина;
		Элементы.Сотрудники.Видимость = Ложь;
		Элементы.РаспределятьПоДолям.Видимость = Ложь;
		Объект.РаспределятьПоДолям = Ложь;
	КонецЕсли;	
	Элементы.СотрудникиДоля.Видимость = Объект.РаспределятьПоДолям;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОграничитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура РаспределятьПоДолямПриИзменении(Элемент)
	Элементы.СотрудникиДоля.Видимость = Объект.РаспределятьПоДолям;
КонецПроцедуры
